# -*- coding: utf-8 -*-
# coding='utf-8'

import re

DEBUG = False

def matchrule( source, regex, multiplier=1, limit=10 ):
    score = 0
    score += min( len(re.findall( regex, source, re.I | re.U)) * multiplier, limit )
    return score

def calculate_filter_score( source, rulelist ):
    totalscore = max ( round( len(source)/100, 0 ), 10 ) 
    if DEBUG: print 'totalscore', totalscore
    score = 0
    for rule in rulelist:
        try:
            if DEBUG: print rule[0].decode('utf-8','ignore').encode('tis-620','ignore'), str(matchrule ( source, rule[0], rule[1], rule[2] ))
            score += matchrule ( source, rule[0], rule[1], rule[2] )
        except Exception as e:
            pass       
    finalscore  = 120 * (round( float(score)/float(totalscore), 2))
    if DEBUG: print 'finalscore', str(-finalscore)
    return -finalscore  
    
def sellvaluescore(data):
    
    sell_value_filter_rule = [
        #sell signal
        [ "บาท",      2, 10 ],
        [ "baht",   2, 10 ],
        [ "ราคา",       2, 10 ],
        [ "ขาย",      5, 30 ],
        [ "ซื้อ",       1, 10 ],
        [ "จัดส่ง",         3, 10 ],
        [ "ฟรี",      1, 10 ],
        [ "เงิน",       1, 10 ],
        [ "สภาพ",   1, 10 ],
        [ "สนใจติดต่อ",     3, 20 ],
        
        ["ของแถม",      2,  10 ],
        ["ลดเหลือ",       3,  20 ],
        ["ติดกันรอย", 1,  10 ],
        ["ต่อลอง",      2,  20 ],
        ["ซื้อมา",      2,  20 ],
        ["ส่งEMS",        4,  20 ],
        ["แกะกล่อง",    1,  10 ],
        ["มีประกัน",        2,  20 ],
        ["เครื่องศูนย์",    3,  20 ],
        ["ทั่วประเทศ",  1,  10 ],
        ["เลขที่บัญชี",   1,  10 ],
        ["ราคาพิเศษ", 4,  30 ],
        ["ขายด่วน",       4,  30 ],
        ["ขายแล้ว",       2,  10 ],
        ["ส่งฟรี",      3,  20 ],
        ["รหัสสินค้า",  1,  10 ],
        ["สนใจตัวไหน",  2,  10 ],
        ["ชำระเงิน",        1,  10 ],
        ["ฝากขาย",      3,  20 ],
        ["ขนส่ง",     1,  10 ],
        ["รับประกัน",     2,  10 ],
        ["โอนเงิน",       2,  10 ],
        ["ฝากซื้อ",       1,  10 ],
        ["สินค้านำเข้า",    2,  20 ],
        ["ลดราคา",      3,  20 ],
        ["ส่งลงทะเบียน",    3,  20 ],
        ["สั่งซื้อ",        2,  20 ],
        ["หน้าร้าน",        2,  10 ],
        ["มีตำหนิ",       1,  10 ],
        ["มือหนึ่ง",        2,  10 ],
        ["มือสอง",      2,  10 ],
        
        ["ครบกล่อง",        2,  10 ],
        ["ราคาดี",      2,  10 ],
        ["ราคางาม",       2,  10 ],
        ["ประกันร้าน",  1,  10 ],
        ["ศูนย์ไทย",        1,  10 ],
        ["อุปกรณ์ครบ",  1,  10 ],
        ["เครื่องนอก",  1,  10 ],
        ["สภาพใหม่",    2,  20 ],
        ["สภาพสวย",   2,  20 ],
        ["พร้้อมใช้งาน",    1,  10 ],
        ["ประกันเหลือ",   1,  10 ],
        ["ลดได้ต่อได้",   3,  20 ],
        ["ขายเหมา",       3,  20 ],
        ["ของแท้",      1,  10 ],
        ["ประกันยาว", 2,  10 ],
        ["สภาพดี",      2,  10 ],
        ["สภาพเยี่ยม",  2,  10 ],
        ["ยกกล่อง",       1,  10 ],
        ["เหลือประกัน",   2,  10 ],
        ["เจ้าของขายเอง", 3,  30 ],
        ["เครื่อง0",      2,  10 ],
        ["สภาพเหมือนใหม่",  2,  20 ],
        ["รับซื้อ",       2,  10 ],
        ["พรีออเดอร์",  3,  30 ],
        ["pre-order",       3,  30 ],
        ["รับหิ้ว",       3,  30 ],
        ["ราคาถูก",       2,  20 ],
        ["สินค้าจากโรงงาน",   2,  20 ],
        ["รับออเดอร์",  3,  30 ],
        ["พร้อมส่ง",        3,  30 ],
        ["ค่าจัดส่ง",     2,  20 ],
        ["ขายส่ง",      2,  20 ],
        ["ขายปลีก",       2,  20],
        ["shop",       2,  20],
    
        #price
        [ " [0-9,]+(00|90|99|50|49) ",  3, 60 ],
        [ " [0-9,xX]+[xX]{2,} ",        3, 60 ]
    ]
    finalscore = calculate_filter_score( data, sell_value_filter_rule )
    return finalscore
    
def spamvaluescore(data):
    
    #spam
    spam_value_filter_rule = [
        [ "งานพิเศษ",   4,  20 ],
        [ "พาร์ไทม์",   4,  10 ],
        [ "งานออนไลน์",     4,  20 ],
        [ "รายได้",     1,  10 ],
        
        [ "รับสมัคร",   3,  10 ],
        [ "บาท/เดือน",  3,  10 ],
        [ "โอกาส",    1,  10 ],
        
        [ "สนใจติดต่อ",     4,  10 ],
        [ "สนใจรับข้อมูล",    4,  10 ],
        
        [ "ลดน้ำหนัก",    2,  10 ],
        [ "โยโย่",        2,  10 ],
        [ "รายได้เสริม",  4,  30 ],
        [ "งานผ่านเน็ต",  4,  30 ],
        [ "ได้เงินจริง",  2,  10 ],
        [ "ทำที่บ้าน",    4,  10 ],
        [ "เงินด่วน",   3,  20 ],
        [ "ลดความอ้วน",     3,  10 ],
        [ "อาหารเสริม",     4,  10 ],
        [ "อาชีพเสริม",     4,  20 ],
        [ "เพิ่มขนาด",    2,  10 ],
        [ "สมรรถภาพ",   1,  10 ],
        [ "ขายของฟรี",    4,  10 ],
        [ "ลงประกาศ",   2,  10 ],
        [ "หางาน",    2,  10 ],
        [ "หนังโป๊",  4,  10 ],
        [ "นักศึกษา",   1,  10 ],
        [ "ไม่ต้องลงทุน",   4,  10 ],
        [ "ไซด์ไลน์",   4,  20 ],
        [ "ไม่ต้องอบรม",  4,  10 ],
        [ "เริ่มงานทันที",    2,  10 ],
        [ "'งานผ่านเว็บ",     4,  10 ],
        [ "รายได้พิเศษ",  4,  20 ],
        [ "รายได้ดี",   4,  10 ]
    ]
    
    finalscore = calculate_filter_score( data, spam_value_filter_rule )
    return finalscore

if __name__ == "__main__":
    testinput="""
    ราคาตั้ง 45,000 B ช่วงเเนะนำ 3X,xxx B คับผม !

    size 46 / 48 สีเเดง / สีดำเข้ามาเเล้วนะคับ 3x.xxx B คับผม !

    เฟรม slope ใส่เล็ก ความฝันของคนความสูงน้องมาเเล้วคับที่จะได้จี่รถเหล็ก !

    Weight 2.05 โล เฟรม + ตะเกียบ / ซ่อนสายเบรค / ท่อ SSTB จาก Miyata ครับ Perofrmace สุดยอดในงบนี้คับ คู่เเข่งโดยตรงกับ ritchey road logic คับ

    086-669-9449 วิม สบายดีไบค์
    http://www.facebook.com/sabuydbikeshop
    """
    DEBUG = True
    print sellvaluescore(testinput)